Revit 2026 API

# ConnectionResolution Enumeration

---

An enumerated type listing all the possible resolutions for connectivity validation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConnectionResolution
```
```vb
Public Enumeration ConnectionResolution
```
```cpp
public enum class ConnectionResolution
```
```fsharp
type ConnectionResolution
```

| Member name | Value | Description |
| --- | --- | --- |
| Disconnected | 0 | Value for parts were disconnected. |

#### Reference

Autodesk.Revit.DB Namespace